andrewleech/imxrt1170_display_driver/src/board/lvgl_support.c
/*
 * Copyright 2019-2022 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "lvgl_support.h"
#include "lvgl.h"
#if defined(SDK_OS_FREE_RTOS)
#include "FreeRTOS.h"
#include "semphr.h"
#endif
#include "board.h"
#include "pin_mux.h"

#include "fsl_gpio.h"
#include "fsl_cache.h"

#if LV_USE_DRAW_VG_LITE
#include "vg_lite.h"
#include "vglite_support.h"
#endif

#if LV_USE_ROTATE_PXP
#include "draw/nxp/pxp/lv_draw_pxp.h"
#include "display/lv_display_private.h"
#endif

#include "py/runtime.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/* Ratate panel or not. */
#ifndef DEMO_USE_ROTATE
#if LV_USE_ROTATE_PXP
#define DEMO_USE_ROTATE 1
#else
#define DEMO_USE_ROTATE 0
#endif
#endif

/* Cache line size. */
#ifndef FSL_FEATURE_L2CACHE_LINESIZE_BYTE
#define FSL_FEATURE_L2CACHE_LINESIZE_BYTE 0
#endif
#ifndef FSL_FEATURE_L1DCACHE_LINESIZE_BYTE
#define FSL_FEATURE_L1DCACHE_LINESIZE_BYTE 0
#endif

#if (FSL_FEATURE_L2CACHE_LINESIZE_BYTE > FSL_FEATURE_L1DCACHE_LINESIZE_BYTE)
#define DEMO_CACHE_LINE_SIZE FSL_FEATURE_L2CACHE_LINESIZE_BYTE
#else
#define DEMO_CACHE_LINE_SIZE FSL_FEATURE_L1DCACHE_LINESIZE_BYTE
#endif

#if (DEMO_CACHE_LINE_SIZE > FRAME_BUFFER_ALIGN)
#define DEMO_FB_ALIGN DEMO_CACHE_LINE_SIZE
#else
#define DEMO_FB_ALIGN FRAME_BUFFER_ALIGN
#endif

#if (LV_ATTRIBUTE_MEM_ALIGN_SIZE > DEMO_FB_ALIGN)
#undef DEMO_FB_ALIGN
#define DEMO_FB_ALIGN LV_ATTRIBUTE_MEM_ALIGN_SIZE
#endif

#define DEMO_BUFFER_STRIDE_BYTE ((DEMO_BUFFER_WIDTH * LCD_FB_BYTE_PER_PIXEL + LV_DRAW_BUF_ALIGN - 1) & ~(LV_DRAW_BUF_ALIGN - 1))
#define DEMO_FB_SIZE_STATIC (DEMO_BUFFER_STRIDE_BYTE * DEMO_BUFFER_HEIGHT)  // Compile-time max size
#define COMPUTE_STRIDE(x) ((x * LCD_FB_BYTE_PER_PIXEL + LV_DRAW_BUF_ALIGN - 1) & ~(LV_DRAW_BUF_ALIGN - 1))

// Helper function to get frame buffer size (runtime-based on actual panel)
static inline size_t get_fb_size(void) {
    const panel_config_t *config = BOARD_GetPanelConfig();

    if (config != NULL) {
        // Calculate size based on actual panel dimensions
        size_t stride = COMPUTE_STRIDE(config->width);
        return stride * config->height;
    }

    // Fallback to compile-time maximum if config not yet available
    return DEMO_FB_SIZE_STATIC;
}
#define DEMO_FB_SIZE get_fb_size()  // Runtime calculation

#if DEMO_USE_ROTATE
#define LVGL_BUFFER_WIDTH  DEMO_BUFFER_HEIGHT
#define LVGL_BUFFER_HEIGHT DEMO_BUFFER_WIDTH
#else
#define LVGL_BUFFER_WIDTH  DEMO_BUFFER_WIDTH
#define LVGL_BUFFER_HEIGHT DEMO_BUFFER_HEIGHT
#endif

#if __CORTEX_M == 4
#define DEMO_FLUSH_DCACHE() L1CACHE_CleanInvalidateSystemCache()
#else
#define DEMO_FLUSH_DCACHE() SCB_CleanInvalidateDCache()
#endif

/*******************************************************************************
 * Prototypes
 ******************************************************************************/
static void DEMO_FlushDisplay(lv_display_t * disp, const lv_area_t * area, uint8_t * px_map);

#if (LV_USE_DRAW_VGLITE || LV_USE_DRAW_VG_LITE || LV_USE_DRAW_PXP)
void DEMO_CleanInvalidateCache(void);
void DEMO_CleanInvalidateCacheByAddr(void *addr, int32_t dsize);
#endif

static void DEMO_BufferSwitchOffCallback(void *param, void *switchOffBuffer);

static void DEMO_WaitBufferSwitchOff(void);

/*******************************************************************************
 * Variables
 ******************************************************************************/

#define DYNAMIC_FB_ALLOC 1

#if DYNAMIC_FB_ALLOC
MP_REGISTER_ROOT_POINTER(uint8_t *s_frameBuffer_alloc);  // malloc output goes here
static uint8_t *s_frameBuffer[2];  // Pointers to aligned framebuffers

#if DEMO_USE_ROTATE
MP_REGISTER_ROOT_POINTER(uint8_t *s_lvglBuffer_alloc);
static uint8_t *s_lvglBuffer[1];  // Pointer to aligned LVGL buffer
#endif

#else
SDK_ALIGN(static uint8_t __attribute__((section(".sdram"))) s_frameBuffer[2][DEMO_FB_SIZE_STATIC], DEMO_FB_ALIGN);
#if DEMO_USE_ROTATE
SDK_ALIGN(static uint8_t __attribute__((section(".sdram"))) s_lvglBuffer[1][DEMO_FB_SIZE_STATIC], DEMO_FB_ALIGN);
#endif
#endif

#if defined(SDK_OS_FREE_RTOS)
static SemaphoreHandle_t s_transferDone;
#else
static volatile bool s_transferDone;
#endif

#if DEMO_USE_ROTATE
/*
 * When rotate is used, LVGL stack draws in one buffer (s_lvglBuffer), and LCD
 * driver uses two buffers (s_frameBuffer) to remove tearing effect.
 */
static void *volatile s_inactiveFrameBuffer;
#endif

// Runtime display dimensions (set during init, used by flush)
static uint16_t s_display_width = 0;
static uint16_t s_display_height = 0;
static uint16_t s_panel_width = 0;
static uint16_t s_panel_height = 0;

/*******************************************************************************
 * Code
 ******************************************************************************/

void lv_port_pre_init(void) {
}

void lv_port_disp_init(void) {

    BOARD_InitMipiPanelPins();

    #define align_up(num, align) (((num) + ((align) - 1)) & ~((align) - 1))

    // Get runtime panel dimensions early - needed for both buffer allocation and display config
    const panel_config_t *config = BOARD_GetPanelConfig();
    s_panel_width = config->width;
    s_panel_height = config->height;
    s_display_width = s_panel_width;
    s_display_height = s_panel_height;

    size_t fb_size = get_fb_size();  // Get actual frame buffer size

    #if DYNAMIC_FB_ALLOC

    // Round fb_size up to alignment boundary to ensure both buffers are aligned
    size_t fb_size_aligned = align_up(fb_size, DEMO_FB_ALIGN);

    MP_STATE_VM(s_frameBuffer_alloc) = m_new0(uint8_t, 2 * fb_size_aligned + DEMO_FB_ALIGN);
    uint8_t *aligned_base = (uint8_t *)align_up((uintptr_t)MP_STATE_VM(s_frameBuffer_alloc), DEMO_FB_ALIGN);
    s_frameBuffer[0] = aligned_base;
    s_frameBuffer[1] = aligned_base + fb_size_aligned;

    PRINTF("FB allocation: fb_size=%d, aligned=%d, align=%d\n",
           fb_size, fb_size_aligned, DEMO_FB_ALIGN);
    PRINTF("  Raw alloc: %p\n", MP_STATE_VM(s_frameBuffer_alloc));
    PRINTF("  buf0=%p (offset=%d, aligned=%s)\n",
           s_frameBuffer[0],
           (uint8_t*)s_frameBuffer[0] - (uint8_t*)aligned_base,
           ((uintptr_t)s_frameBuffer[0] & (DEMO_FB_ALIGN-1)) == 0 ? "YES" : "NO");
    PRINTF("  buf1=%p (offset=%d, aligned=%s)\n",
           s_frameBuffer[1],
           (uint8_t*)s_frameBuffer[1] - (uint8_t*)aligned_base,
           ((uintptr_t)s_frameBuffer[1] & (DEMO_FB_ALIGN-1)) == 0 ? "YES" : "NO");

    #if DEMO_USE_ROTATE
    MP_STATE_VM(s_lvglBuffer_alloc) = m_new0(uint8_t, fb_size + DEMO_FB_ALIGN);
    s_lvglBuffer[0] = (uint8_t *)align_up((uintptr_t)MP_STATE_VM(s_lvglBuffer_alloc), DEMO_FB_ALIGN);
    #endif

	#else // static FB alloc

    memset(s_frameBuffer, 0, sizeof(s_frameBuffer));
    #if DEMO_USE_ROTATE
    memset(s_lvglBuffer, 0, sizeof(s_lvglBuffer));
    #endif

    PRINTF("FB static allocation: fb_size=%d, align=%d, buf0=%p, buf1=%p\n",
           fb_size, DEMO_FB_ALIGN, s_frameBuffer[0], s_frameBuffer[1]);
    PRINTF("  buf0 alignment check: %p & %d = %d (should be 0)\n",
           s_frameBuffer[0], DEMO_FB_ALIGN-1, ((uintptr_t)s_frameBuffer[0]) & (DEMO_FB_ALIGN-1));
    PRINTF("  buf1 alignment check: %p & %d = %d (should be 0)\n",
           s_frameBuffer[1], DEMO_FB_ALIGN-1, ((uintptr_t)s_frameBuffer[1]) & (DEMO_FB_ALIGN-1));

    #endif

    status_t status;
    dc_fb_info_t fbInfo;

    #if LV_USE_DRAW_VG_LITE
    /* Initialize GPU. */
    BOARD_PrepareVGLiteController();
    #endif

    /*-------------------------
     * Initialize your display
     * -----------------------*/
    BOARD_PrepareDisplayController();

    status = g_dc.ops->init(&g_dc);
    if (kStatus_Success != status) {
        assert(0);
    }

    g_dc.ops->getLayerDefaultConfig(&g_dc, 0, &fbInfo);
    fbInfo.pixelFormat = DEMO_BUFFER_PIXEL_FORMAT;
    fbInfo.width = s_panel_width;
    fbInfo.height = s_panel_height;
    fbInfo.startX = DEMO_BUFFER_START_X;
    fbInfo.startY = DEMO_BUFFER_START_Y;
    fbInfo.strideBytes = COMPUTE_STRIDE(s_panel_width);

    size_t computed_stride = COMPUTE_STRIDE(s_panel_width);
    size_t computed_fb_size = computed_stride * s_panel_height;

    PRINTF("Display config: %dx%d, stride=%d bytes\n",
           fbInfo.width, fbInfo.height, fbInfo.strideBytes);
    PRINTF("  Computed: stride=%d, fb_size=%d (actual fb_size=%d)\n",
           computed_stride, computed_fb_size, fb_size);
    PRINTF("  Pixel format: RGB565 (2 bytes/pixel)\n");
    PRINTF("  Stride alignment: LV_DRAW_BUF_ALIGN=%d\n", LV_DRAW_BUF_ALIGN);

    g_dc.ops->setLayerConfig(&g_dc, 0, &fbInfo);

    g_dc.ops->setCallback(&g_dc, 0, DEMO_BufferSwitchOffCallback, NULL);

    #if defined(SDK_OS_FREE_RTOS)
    s_transferDone = xSemaphoreCreateBinary();
    if (NULL == s_transferDone) {
        PRINTF("Frame semaphore create failed\r\n");
        assert(0);
    }
    #else
    s_transferDone = false;
    #endif

    #if DEMO_USE_ROTATE
    /* s_frameBuffer[1] is first shown in the panel, s_frameBuffer[0] is inactive. */
    s_inactiveFrameBuffer = (void *)s_frameBuffer[0];
    #endif

    /* lvgl starts render in frame buffer 0, so show frame buffer 1 first. */
    g_dc.ops->setFrameBuffer(&g_dc, 0, (void *)s_frameBuffer[1]);

    /* Wait for frame buffer sent to display controller video memory. */
    if ((g_dc.ops->getProperty(&g_dc) & kDC_FB_ReserveFrameBuffer) == 0) {
        DEMO_WaitBufferSwitchOff();
    }

    g_dc.ops->enableLayer(&g_dc, 0);

    /*-----------------------------------
     * Register the display in LittlevGL
     *----------------------------------*/

    // Changes in master (v9 development) https://github.com/lvgl/lvgl/issues/4011

    // Panel dimensions already set at start of function

    // TODO: Re-enable dimension swap after testing stability
    #if 0 // DEMO_USE_ROTATE
    // Swap dimensions for rotation
    uint16_t temp = s_display_width;
    s_display_width = s_display_height;
    s_display_height = temp;
    #endif

    lv_display_t * disp = lv_display_create(s_display_width, s_display_height);
    lv_display_set_flush_cb(disp, DEMO_FlushDisplay);
    // TODO: Re-enable rotation after testing stability
    // lv_display_set_rotation(disp, LV_DISPLAY_ROTATION_270);

    #if DEMO_USE_ROTATE
    lv_display_set_buffers(disp, s_lvglBuffer[0], NULL, fb_size, LV_DISPLAY_RENDER_MODE_FULL);
    #else
    lv_display_set_buffers(disp, s_frameBuffer[0], s_frameBuffer[1], fb_size, LV_DISPLAY_RENDER_MODE_FULL);
    #endif

#if LV_USE_DRAW_VG_LITE
    if (vg_lite_init(DEFAULT_VG_LITE_TW_WIDTH, DEFAULT_VG_LITE_TW_HEIGHT) != VG_LITE_SUCCESS)
    {
        PRINTF("VGLite init error. STOP.");
        vg_lite_close();
        while (1)
            ;
    }

    if (vg_lite_set_command_buffer_size(VG_LITE_COMMAND_BUFFER_SIZE) != VG_LITE_SUCCESS)
    {
        PRINTF("VGLite set command buffer. STOP.");
        vg_lite_close();
        while (1)
            ;
    }
#endif
}

void lv_port_disp_init_with_config(const panel_config_t *config) {
    // Store runtime panel configuration
    BOARD_InitDisplayWithConfig(config);

    // Initialize display with runtime config
    // (uses same code path as lv_port_disp_init, but with runtime parameters)
    lv_port_disp_init();
}

void lv_port_disp_deinit(void) {
    BOARD_DeinitLcdPanel();
}

static void DEMO_BufferSwitchOffCallback(void *param, void *switchOffBuffer) {
    #if defined(SDK_OS_FREE_RTOS)
    BaseType_t taskAwake = pdFALSE;

    xSemaphoreGiveFromISR(s_transferDone, &taskAwake);
    portYIELD_FROM_ISR(taskAwake);
    #else
    s_transferDone = true;
    #endif

    #if DEMO_USE_ROTATE
    s_inactiveFrameBuffer = switchOffBuffer;
    #endif
}

#if (LV_USE_DRAW_VGLITE || LV_USE_DRAW_VG_LITE || LV_USE_DRAW_PXP)
void DEMO_CleanInvalidateCache(void)
{
    DEMO_FLUSH_DCACHE();
}

void DEMO_CleanInvalidateCacheByAddr(void *addr, int32_t dsize)
{
    SCB_CleanInvalidateDCache_by_Addr(addr, dsize);
}
#endif

static void DEMO_WaitBufferSwitchOff(void) {
    #if defined(SDK_OS_FREE_RTOS)
    if (xSemaphoreTake(s_transferDone, portMAX_DELAY) != pdTRUE) {
        PRINTF("Display flush failed\r\n");
        assert(0);
    }
    #else
    while (false == s_transferDone) {
    }
    s_transferDone = false;
    #endif
}

void DEMO_FlushDisplay(lv_display_t * disp, const lv_area_t * area, uint8_t * color_p) {

    #if DEMO_USE_ROTATE

    /*
     * Work flow:
     *
     * 1. Wait for the available inactive frame buffer to draw.
     * 2. Draw the ratated frame to inactive buffer.
     * 3. Pass inactive to LCD controller to show.
     */

    static bool firstFlush = true;

    /* Only wait for the first time. */
    if (firstFlush) {
        firstFlush = false;
    } else {
        /* Wait frame buffer. */
        DEMO_WaitBufferSwitchOff();
    }

    DEMO_FLUSH_DCACHE();

    /* Copy buffer. */
    void *inactiveFrameBuffer = s_inactiveFrameBuffer;

    #if LV_USE_ROTATE_PXP /* Use PXP to rotate the panel. */
    lv_draw_pxp_rotate(color_p, inactiveFrameBuffer,
                       s_display_width, s_display_height,
                       COMPUTE_STRIDE(s_display_width),
                       COMPUTE_STRIDE(s_panel_width),
                       LV_DISPLAY_ROTATION_270, disp->color_format);

    #else /* Use CPU to rotate the panel. */
    lv_draw_sw_rotate(color_p, inactiveFrameBuffer,
                      s_display_width, s_display_height,
                      COMPUTE_STRIDE(s_display_width),
                      COMPUTE_STRIDE(s_panel_width),
                      LV_DISPLAY_ROTATION_270, disp->color_format);
    #endif

    DEMO_FLUSH_DCACHE();

    g_dc.ops->setFrameBuffer(&g_dc, 0, inactiveFrameBuffer);

    /* IMPORTANT!!!
     * Inform the graphics library that you are ready with the flushing*/
    lv_display_flush_ready(disp);

    #else /* DEMO_USE_ROTATE */

    /* Flush cache so display controller can see the pixels LVGL just rendered */
    DEMO_FLUSH_DCACHE();

    /* Give the newly rendered buffer to the display controller */
    g_dc.ops->setFrameBuffer(&g_dc, 0, (void *)color_p);

    /* Wait for the display controller to switch to this buffer before
     * telling LVGL it can reuse it for the next frame */
    DEMO_WaitBufferSwitchOff();

    /* IMPORTANT!!!
     * Inform the graphics library that you are ready with the flushing*/
    lv_display_flush_ready(disp);
    #endif /* DEMO_USE_ROTATE */
}

